# Исследование неоптимальных тарифов активных пользователей компании "Нупозвони"
---
## Описание проекта:
"Нупозвони" - компания, предоставляющая услуги виртуальной телефонии. Клиентами провайдера являются колл-центры, которые распределяют входящие звонки между операторами и осуществляют исходящие звонки с использованием ресурсов операторов. Чтобы пользователи не перешли к конкурентам и остались лояльными к компании, коммерческому директору провайдера необходима информация с неоптимальными тарифами, используемыми активными клиентами. Также необходимо подобрать тариф, который более выгоден для пользователя, но при этом минимизирует потери выручки.
## Цели исследования:
Изучить данные за последние три месяца, выявить активных клиентов, которые переплачивают за услуги, определить сумму переплаты и подобрать более выгодный тариф для этих пользователей, при этом минимизировать потерю выручки компании.
## Задачи исследования:
- Определить базу активных клиентов
- Изучить тарифный план активных клиентов
- Определить сумму переплаты
- Подобрать оптимальный тариф
- Изучить изменения в выручке
- Проверить гипотезы
## Выводы и рекомендации по исследованию
В данном исследовании был проведен анализ неоптимальных тарифов активных пользователей компании "Нупозвони". <br>
Входные данные - информация по активности клиентов за 4 месяца, тарифы клиентов, а также сам тарифный план.<br>
Цель исследования - Изучить данные за последние три месяца, выявить активных клиентов, которые переплачивают за услуги, определить сумму переплаты и подобрать более выгодный тариф для этих пользователей, при этом минимизировать потерю выручки компании.<br>

На этапе предобработки данных:
- пропуски были заменены на значения пустышку, либо удалены.
- явные дубликаты были удалены
- типы данных были изменены на более удобные для анализа
- новый столбец month был добавлен

На этапе исследовательского анализа данных было выявлено, что:
- 54% клиентов на тарифе A, 36% на тарифе C, а 10% на тарифе B
- в ноябре, октябре и сентябре медианное значение кол-ва звонков 90, 78, 56.5 соответсвенно.
- в ноябре, октябре и сентябре медианное значение длительности звонка 103.6,	83,	65.6 минут соответсвенно.
- в ноябре, октябре и сентябре медианное значение выручки с клиента 2308.9, 2300, 2307.9 рублей соответсвенно.

а так же:
- был определен критерий активного клиента, т.е те, кто звонит чаще, разговаривает дольше и приносит выручку больше медианного значения
- по данным параметрам подошли 108 клиентов
- 56 из 145 активных клиентов уже на выгодном тарифе. 
- при смене тарифа, в среднем клиент экономит 600 рублей в месяц, 
- а самым выгодным переходом, является переход на тариф B.
- выручка до смены тарифов 1990979.48 рублей, а после смены тарифов 1853535.51 рублей, т.е она упала на 7%
- при смене тарифа выручка в тарифе C увеличилась на 11.78 %
- При смене тарифа средний чек в сентябре снизилась на 7.31 %, в октябре на 6.69 %, в ноябре снизилась на 6.86 %


На этапе проверки гипотез:
- Нулевая гипотеза отвергнута.  Выручки до и после смены тарифа отличаются.
- Нулевая гипотеза не отвергнута. Размер затрат клиента в месяц зависит от месяца.
- Нулевая гипотеза отвергнута. Выручка на тарифе C отличается от выручки на других тарифах.

Рекомендации:
- оценить ущерб 7% падения прибыли на финансовые показатели компании.
- проверить аномальные значения количественных переменных по операторам, уточнить, почему некоторые операторы разговаривают больше 24 часов в сутки.

